//// { order: 1 }

// 새로운 Playground를 이용하면 URLs은 당신의 설정의 대한
// 더 많은 정보를 포함할 것 입니다.
// 그러므로 복제는 더 정확해지며 당신은 누군가에게 설정을 복제하기
// 위해 특정한 컴파일러 플래그를 누르라고 말할 필요가 없습니다.

// URLs은 다음과 같은 내용을 포함합니다:
//
// - 예시에 해당하는지에 대한 여부
// - TypeScript / JavaScript 용 gzip으로 압축 된 소스 코드
// - gzip으로 압축되지 않은 이전 URLs에 대한 하위 호환성
// - 당신이 작업중인 언어
// - 당신의 컴파일러 설정과 기본 값의 차이
//   예시: 새 컴파일러 기본 값
// - 텍스트 선택 강조 표시
//
// URLs은 위에 것들이 변경될때마다 
// HTML5의 replaceState를 이용해 자동으로 업데이트됩니다.
// 당신의 페이지 뒤로 돌아가기도 예상대로 작동할것입니다.

// 예시로 로딩중 가끔식 e=[number]가 보일 것 입니다. 
// 이것은 당신이 예시들을 번갈아 볼 때 브라우저가 새로고침을 정확하게 하는것을 보장하기 위해서입니다. 
// 걱정하지 않아도 됩니다.

// 일부 댓글을 수정하거나 일부 텍스트를 선택하여
// 이 페이지에서 URLs 변경을 볼 수 있습니다.
// 브라우저의 새로고침을 누르면 본래의 상태로
// 돌아갈 수 있습니다.